app/views/prototypes/edit.html.haml

SELECT `captured_images`.* FROM `captured_images` WHERE `captured_images`.`prototype_id` = 3
---
                    = image.file_field :content
            - (4 - @prototype.captured_images.length).times do |i|