app/views/prototypes/show.html.haml

      %ul.proto-sub-list.list-group
        - @prototype.captured_images.sub.each do |image|
---
SELECT `captured_images`.* FROM `captured_images` WHERE `captured_images`.`prototype_id` = 5