app/controllers/likes_controller.rb

INSERT INTO `likes` (`user_id`, `prototype_id`, `created_at`, `updated_at`) VALUES (1, 2, '2018-03-15 00:59:23', '2018-03-15 00:59:23')
---
  def create
    @like = Like.new(user_id: current_user.id, prototype_id: params[:prototype_id])
    if @like.save

SELECT  `likes`.* FROM `likes` WHERE `likes`.`id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1
---
  def destroy
    like = Like.find(params[:id])
    like.destroy