app/controllers/prototypes_controller.rb

SELECT `prototypes`.* FROM `prototypes`
---
  def index
    @prototypes = Prototype.all

INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('シューゾー', 'さむーい', '日本の四季', 1, '2018-03-08 01:26:19', '2018-03-08 01:26:19')
---
  def create
    @prototype = Prototype.new(prototype_params)
    if @prototype.save

UPDATE `prototypes` SET `title` = 'first3', `catch_copy` = '＠＠＠＠＠ppppppp', `concept` = '＠＠＠＠＠ppppppp', `updated_at` = '2018-03-14 00:59:35' WHERE `prototypes`.`id` = 4
---
  def update
    # binding.pry
     @prototype.update(prototype_params) if @prototype.user_id == current_user.id

SELECT  `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = NULL LIMIT 1
---
  def set_prototype
    @prototype = Prototype.find(params[:id])